CSI API ETABS v1

# cTendonObjGetNameListOnStory Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetNameListOnStory(
    	string StoryName,
    	ref int NumberNames,
    	ref string[] MyName
    )

    Function GetNameListOnStory (
    	StoryName As String,
    	ByRef NumberNames As Integer,
    	ByRef MyName As String()
    ) As Integer

    Dim instance As cTendonObj
    Dim StoryName As String
    Dim NumberNames As Integer
    Dim MyName As String()
    Dim returnValue As Integer

    returnValue = instance.GetNameListOnStory(StoryName,
    	NumberNames, MyName)

    int GetNameListOnStory(
    	String^ StoryName,
    	int% NumberNames,
    	array<String^>^% MyName
    )

    abstract GetNameListOnStory :
            StoryName : string *
            NumberNames : int byref *
            MyName : string[] byref -> int

#### Parameters

StoryName

    Type: SystemString

NumberNames

    Type: SystemInt32

MyName

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cTendonObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com